[LANG]
language=Russian (русский язык)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Ошибка синтаксиса SQL
200002=Файл не существует
200003=Файл поврежден
200004=Ошибка параметра
200026=Имя таблицы уже существует
200027=Имя таблицы не существует
200028=Ошибка импорта CSV файла, не удалось создать SQL, проверьте содержимое CSV файла и конфигурацию
300001=Не выбраны столбцы таблицы для создания индекса
300002=SQL-запрос не может быть пустым
300003=Анализ SQL поддерживает только SELECT запросы
[STRING]
home=Главная
database=База данных
analysis=Анализ
view=Представление
setting=Настройки
items=записей
tables=Таблицы
views=Представления
triggers=Триггеры
columns=Столбцы
indexes=Индексы
table=Таблица
clear-all=Очистить все
yes=Да
no=Нет
welcome-text=Добро пожаловать в CuteSqlite
home-text1=CuteSqlite - это графический клиент (GUI) для Sqlite3.
home-text2=Он позволяет проектировать, создавать и просматривать базы данных, управлять объектами базы данных,
home-text3=вставлять данные, а также разрабатывать и выполнять SQL-запросы для обработки хранящихся данных.
home-text4=Вы также можете перенести базу данных и данные от других поставщиков баз данных в базу данных Sqlite.
db-section-text=База данных Sqlite
analysis-text1=CuteSqlite позволяет анализировать и оптимизировать производительность SQL-запросов.
home-text2=А также позволяет анализировать объем хранилища каждой таблицы в базе данных,
home-text3=и настраивать параметры базы данных для ее оптимизации.
perf-analysis-section-text=Анализ производительности
error-text=Системная ошибка:
create-database=Создать новую базу данных (Ctrl+N)
open-database=Открыть базу данных (Ctrl+O)
refresh-database=Обновить базу данных (F5)
delete-database=Удалить выбранную БД из списка (Del)
override-user-db=Данные удаленного файла невозможно восстановить. Подтвердить перезапись базы данных?
create-db-success-text=База данных успешно создана
open-db-exists-inlist=База данных уже открыта, не повторяйте операцию
open-db-success-text=База данных успешно открыта
delete-user-db=Подтвердите удаление базы данных "{dbName}" из списка?
delete-db-success-text=База данных успешно удалена из списка
query-editor=Редактор запросов
history=История
history-tip=История (F8)
result-list=Результаты
result-info=Информация
result-table-data=Данные таблицы
table-properties=Свойства таблицы
exec-select-sql=Выполнить выбранный запрос (F9)
exec-all-sql=Выполнить все запросы (F10)
explain-select-sql=Explain выбранного SQL-запроса (F11)
explain-query-plan-sql=Explain query plan выбранного SQL-запроса (F12)
query-page-help=Функция автозаполнения: [Tab]->следующая вкладка; [Ctrl+Space]->показать список совпадений; [Ctrl+Enter]->показать все теги
no-select-userdb=База данных не выбрана
no-sql-statement=В редакторе запросов нет SQL-запроса
no-sql-content=Редактор запросов не содержит SQL-запроса
show-form-view=Показать представление формы
export-result-as=Экспортировать как... (Ctrl+Alt+E)
copy-result-data=Копировать данные в буфер обмена
clear-all=Очистить все
ok=ОК
cancel=Отмена
export-text-description=Выберите формат для экспорта данных
csv-settings=Параметры CSV
csv-field-settings=Столбцы
csv-line-settings=Строки
csv-charset-settings=Кодировка
excel-settings=Параметры Excel
sql-settings=Параметры SQL
export-fields-settings=Выберите столбцы для экспорта
terminated-by=Разделитель
enclosed-by=Ограничитель
escaped-by=Экранирующий символ
field-terminated-by=Разделитель столбцов
field-enclosed-by=Ограничитель столбцов
field-escaped-by=Экранирующий символ столбцов
line-terminated-by=Разделитель строк
add-column-name=Добавить имена столбцов в заголовок
csv-charset=Кодировка
excel-column-max-size=Ограничение размера текстового столбца
excel-decinmal-places=Десятичные знаки
structure-only=Только структура
data-only=Только данные
structure-and-data=Структура и данные
select-all=Выбрать все
deselect-all=Снять выделение
save-to-file=Сохранить в файл
expert-fmt-error=Пожалуйста, выберите формат файла для экспорта данных
terminated-by-error=Пожалуйста, введите значение для "Разделитель"
enclosed-by-error=Пожалуйста, введите значение для "Ограничитель"
escaped-by-error=Пожалуйста, введите значение для "Экранирующий символ"
line-terminated-by-error=Значение "Разделитель строк" неверно
excel-column-max-size-error=Пожалуйста, введите значение для "Ограничение размера текстового столбца"
excel-decinmal-places-error=Пожалуйста, введите значение для "Десятичные знаки"
export-sql-error=Пожалуйста, выберите параметры SQL
selected-fields-error=Пожалуйста, выберите поля для экспорта
export-path-error=Пожалуйста, укажите путь к файлу экспорта
sql-notsupport-multitable-query-error=Экспорт результатов многотабличных запросов и подзапросов не поддерживается
export-success-text=Экспорт выполнен успешно, экспортировано {rows} строк(и). Открыть файл?
open-the-file=Открыть файл
export-file-exists-prompt={export-path} уже существует. Заменить?
limit-rows=Лимит строк
offset=Начальная строка
rows=Количество строк
copy-all-rows-to-clipboard=Копировать все строки в буфер обмена Ctrl+Alt+A
copy-sel-rows-to-clipboard=Копировать выбранные строки в буфер обмена Ctrl+Alt+H
copy-all-rows-as-sql=Копировать все строки как SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Копировать выбранные строки как SQL Ctrl+Alt+K
read-only=Только чтение
filter=Фильтр (Ctrl+Alt+F)
filter-in-use=Фильтр используется
refresh=Обновить (Ctrl+F5)
refresh-page=Обновить
new-row-tip=Новая строка (Ctrl+Alt+N)
copy-row-tip=Копировать строку (Ctrl+Alt+C)
save-tip=Сохранить (Ctrl+Alt+S)
delete-tip=Удалить выбранные строки (Ctrl+Del)
cancel-tip=Отменить изменения (Ctrl+Alt+Z)
revert-tip=Восстановить
save=Сохранить
revert=Отменить изменения
column=Имя столбца
condition=Условие
value=Значение
delete-confirm-text=Подтвердить удаление выбранных строк?
query=Запрос
result=Результат
affected-rows=Затронуто строк
exec-time=Время выполнения
transfer-time=Время передачи
total-time=Общее время
database-create=Создать БД Ctrl+N
database-open=Открыть БД Ctrl+O
database-refresh=Обновить БД Ctrl+R
database-delete=Удалить БД Del
database-copy=Копировать БД как... Ctrl+P
database-export-as-sql=Экспортировать БД в SQL Ctrl+E
database-import-from-sql=Импортировать SQL в БД Ctrl+I
database-new=Создать
database-new-table=Таблицу
database-new-view=Представление
database-new-trigger=Триггер
export-as-sql-text-description=Экспортировать выбранные таблицы/представления/триггеры БД как SQL
select-database=Выбранная база данных
database-objects=Объекты
structure-and-data-settings=Настройки структуры и данных
insert-statement-settings=Настройки INSERT
tbl-statement-settings=Настройки операторов таблицы
retain-column-text=Сохранять имена столбцов в "Insert Into"
contain-multi-rows-text=Каждый оператор "Insert" содержит несколько строк (VALUES)
retain-table-text=Сохранять старую таблицу (Create Table If Not Exists ...)
override-table-text=Перезаписывать старую таблицу (DROP TABLE, затем CREATE TABLE)
import-from-sql-text-description=Пакетное выполнение операторов из SQL-файла.
abort-on-error-text=Останавливаться при ошибке.
import-file-not-exists=Импортируемый SQL-файл не существует, выберите заново.
import-path-empty-error=Путь к файлу импорта не может быть пустым.
import=Импорт
export=Экспорт
tbl-name=Имя таблицы
new-table=Создать таблицу
new-view=Создать представление
new-trigger=Создать триггер
database=База данных
schema=Схема
table-columns=Столбцы
table-indexes=Индексы
table-foreignkeys=Внешние ключи
column-name=Имя столбца
data-type=Тип данных
default=По умолчанию
check=Проверка
index-name=Имя индекса
index-type=Тип индекса
index-unique=Уникальный
partial-clause=Частичное условие
comments=Комментарии
to-be-selected=Доступные поля
selected=Выбранные
up=▲
down=▼
no-columns-selected=Не выбраны столбцы, пожалуйста, выберите
sql-preview=Предпросмотр SQL
tbl-name-empty=Имя таблицы не может быть пустым
tbl-name-duplicated=Имя таблицы уже существует
create-table-success-text=Таблица успешно создана.
alter-table-success-text=Таблица успешно изменена.
rename-table-success-text=Имя таблицы успешно изменено.
delete-column-confirm-text=Выбранный столбец используется одним или несколькими индексами. Удаление этого столбца также изменит соответствующие индексы. Подтвердить удаление?
delete-index-confirm-text=Выбранный индекс используется одним или несколькими столбцами. Удаление этого индекса также изменит соответствующие столбцы. Подтвердить удаление?
delete-confirm-text=Подтвердить удаление?
new-view=Создать представление
new-trigger=Создать триггер
create-a-view-name=Имя нового представления
view-name-not-empty=Имя нового представления не может быть пустым
view-name-duplicated=Имя представления уже существует
create-a-trigger-name=Имя триггера
trigger-name-not-empty=Имя триггера не может быть пустым
trigger-name-duplicated=Имя триггера уже существует
execute-sql-success=SQL успешно выполнен
copy-db-success-text=База данных успешно скопирована
table-open=Открыть данные таблицы Alt+O
table-create=Создать таблицу Alt+N
table-alter=Изменить таблицу Alt+A
table-rename=Переименовать таблицу Alt+M
table-truncate=Очистить таблицу Alt+T
table-drop=Удалить таблицу Alt+Del
table-copy-as=Копировать таблицу в... Alt+P
table-sharding-as=Шардинг Alt+G
table-export=Экспортировать таблицу в... Alt+E
table-import-sql=Импорт из SQL файла Alt+I
table-import-csv=Импорт из CSV файла Alt+J
table-manage-index=Управление индексами таблицы
table-manage-foreign-key=Управление внешними ключами таблицы
properties=Свойства
primary-key-duplicated=Первичный ключ определен повторно.
foreignkey-name=Имя внешнего ключа
referencing-columns=Столбцы текущей таблицы
referenced-table=Связанная таблица
referenced-columns=Связанные столбцы
on-update=При обновлении
on-delete=При удалении
insert-new-column=Добавить новый столбец
insert-new-index=Добавить новый индекс
insert-new-foreignkey=Добавить новый внешний ключ
insert-del-column=Удалить выбранный столбец
insert-del-index=Удалить выбранный индекс
insert-del-foreignkey=Удалить выбранный внешний ключ
select-referenced-table-first=Сначала выберите связанную таблицу
new-table-name=Новое имя таблицы
table-name-not-empty=Новое имя таблицы не может быть пустым
table-name-duplicated=Новое имя таблицы уже существует
ai-column-exists=Столбец с AUTOINCREMENT уже существует.
ai-fobidden-multi-pk=Уже есть столбец с AUTOINCREMENT, несколько первичных ключей не допускаются.
ai-column-must-integer=Столбец с AUTOINCREMENT должен быть типа INTEGER.
truncate-table-confirm-text=После очистки таблицы данные невозможно восстановить. Подтвердить очистку?
truncate-table-success-text=Данные таблицы успешно очищены
drop-table-confirm-text=После удаления таблицы данные невозможно восстановить. Подтвердить удаление?
drop-table-success-text=Таблица успешно удалена
copy-table-text-description=Настройка параметров копирования, поддерживается шардинг таблиц
from-db-name=Исходная БД
from-tbl-name=Исходная таблица
to-db-name=Целевая БД
to-tbl-name=Целевая таблица
table-sharding-setttings=Шардинг таблицы
enable-table-sharding=Включить шардинг таблицы
table-suffix-begin={suffix} Начальное целое
table-suffix-end={suffix} Конечное целое
advanced-settings=Дополнительные параметры шардинга
enable-copy-data-with-strategy=Включить стратегию копирования данных в шардированные таблицы
sharding-strategy-express-text=Выражение стратегии шардинга: {n}
preview-sql=Предпросмотр SQL
structure-and-data-settings-unknown=Не выбраны настройки структуры и данных
table-suffix-error=Неверное целое для шардинга, укажите правильное значение
target-table-name-no-n=Целевая таблица должна содержать строку "{n}".
sharding-strategy-express-empty=Выражение стратегии шардинга не может быть пустым
copy-table-success-text=Таблица успешно скопирована.
start=Старт
complete=Завершено
express-title=Выражение стратегии шардинга таблицы
functions=Функции
express-editor-help=Выражение - дважды щелкните функцию или поле, чтобы вставить в редактор
import-from-csv-text-description=Настройки для импорта данных из CSV файла
source-csv-file=Путь к исходному CSV файлу
target-database=Целевая база данных
target-table=Целевая таблица
columns-setttings=Столбцы
csv-data=Данные CSV
column-name-on-top=Первая строка как имена столбцов
line-terminated-by=Разделитель строк
csv-null-as-keyword=null/NULL как ключевое слово SQL
encoding=Кодировка
import-success-text=Импорт выполнен успешно
incorrect-sql-statement=Неверный SQL-запрос
import-error-text=Ошибка импорта
table-manage-columns=Управление столбцами
table-drop-column=Удалить столбец
table-manage-indexes=Управление индексами
table-drop-index=Удалить индекс
create-view=Создать новое представление
open-view=Открыть представление
drop-view=Удалить представление
create-trigger=Создать триггер
open-trigger=Открыть триггер
drop-trigger=Удалить триггер
drop-view-confirm-text=После удаления представление невозможно восстановить. Подтвердить удаление?
drop-view-success-text=Представление успешно удалено
drop-trigger-confirm-text=После удаления триггер невозможно восстановить. Подтвердить удаление?
drop-trigger-success-text=Триггер успешно удален
sql-templates=Шаблоны SQL
pragma-templates=Pragmas
sql-log=История SQL
clear-all=Очистить все
use=Использовать
explain=Explain
top=Закрепить
untop=Открепить
copy=Копировать
delete=Удалить
today=Сегодня
yestoday=Вчера
delete-sql-log-confirm-text=Вы уверены, что хотите удалить историю SQL?
copy-to-clipboard=Скопировано в буфер обмена
save-success-text=Сохранение выполнено успешно
delete-success-text=Удаление выполнено успешно
data-has-changed=Данные были изменены. Вы уверены, что хотите закрыть страницу?
not-save-and-close=Не сохранять, закрыть
cancel=Отменить закрытие
table-export-as=Экспорт таблицы Alt+E
export-as-sql-success-text=Экспорт выполнен успешно. Открыть файл?
new-query=Новое окно запроса (F7)
save-current=Сохранить текущее (Ctrl+S)
save-all=Сохранить все (Ctrl+Shift+S)
first-page=Первая страница
prev-page=Предыдущая страница
next-page=Следующая страница
last-page=Последняя страница
save-if-data-has-changed=Данные были изменены. Сохранить перед закрытием?
unsort=Отменить сортировку
tab-close-this=Закрыть эту
tab-close-others=Закрыть остальные
tab-close-left=Закрыть все слева
tab-close-right=Закрыть все справа
perf-analysis=Анализ производительности
perf-analysis-reports=Отчеты анализа
store-analysis=Анализ хранилища
db-params=Параметры БД
not-select-sql=Поддерживаются только SELECT запросы
open-sql-log=Открыть историю SQL для анализа производительности (Ctrl+L)
add-sql-analysis=Введите SQL-запрос для анализа производительности (Ctrl+I)
sql-log-not-found=История SQL не найдена, проверьте, не была ли она удалена
original-sql=Исходный SQL-запрос
where-clause-analysis=Анализ условия WHERE
order-clause-analysis=Анализ условия ORDER
covering-index-analysis=Анализ покрывающих индексов
table-join-analysis=Анализ JOIN
in-table=Таблица данных
where-use-column=Условие WHERE использует столбцы
order-use-column=Условие ORDER использует столбцы
covering-index-column=Условия WHERE и ORDER используют столбцы
where-use-index=Условие WHERE использует индекс
order-use-index=Условие ORDER использует индекс
use-covering-index=Используется покрывающий индекс
create-index-for-performance=Рекомендация: создайте индекс для следующих полей, чтобы повысить производительность запросов
hint-index-for-performance=Подсказка: индекс {hintIndexName} уже покрывает поля: {hintIndexColumns}
create-covering-index-for-performance=Рекомендация: создайте покрывающий индекс для следующих полей, чтобы повысить производительность запросов
create-index-togeger=Создать индекс (вместе)
create-index-individ=Создать индекс (отдельно)
create-covering-index=Создать покрывающий индекс
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Псевдокод ниже показывает процесс выполнения оптимизатора запросов
cycle-count=Статистика циклов
optimize-cycle-count=Подсказка: изменение порядка соединения таблиц JOIN может оптимизировать и уменьшить количество циклов.
general-settings=Общие настройки
about=О программе
language-setting=Настройка языка интерфейса
change-language-restart-text=Для изменения языка необходимо перезапустить программу.
close-and-restart=Закрыть и перезапустить
do-not-restart=Не перезапускать
about-us=О нас
about-us-description=CuteSqlite - это программное обеспечение с открытым исходным кодом, разработанное Xuehan Qin.
version-info=Версия
version-info-description=CuteSqlite v0.2.2 beta (64-разрядная)
feedback=Обратная связь
feedback-description=Если у вас возникли проблемы с программным обеспечением, есть идеи или предложения по его улучшению, пожалуйста, заполните форму ниже, чтобы отправить нам отзыв.
content-text=Содержание
license=Лицензия Apache версии 2.0
select-columns-analysis=Анализ полей SELECT
select-use-column=Оператор SELECT использует следующие поля
select-use-column-count=Количество полей
select-use-column-advice=Рекомендация: оператор SELECT выбирает более {maxColumns} полей. Уменьшение количества полей может повысить производительность запросов.
select-use-column-tips=Подсказка: уменьшение количества полей может повысить производительность запросов.
sql-perf-report-prefix=отчет-производительности-sql-
store-analysis-prefix=Анализ хранилища:
analysis-sql=Анализ SQL
open-perf-report=Открыть отчет Alt+O
drop-perf-report=Удалить отчет Alt+Del
drop-perf-report-confirm-text=Подтвердить удаление отчета?
store-analysis-text=Позволяет анализировать объем хранилища, занимаемый базой данных, таблицами и индексами
table-store-analysis=Таблица - {tblName}
index-store-analysis=Индекс - {idxName} - Таблица: {tblName}
db-disk-used-title=Отчет об использовании дискового пространства, путь к БД: {dbPath}
page-size-text=Размер страницы (байт)
page-size-tips=Размер страницы (байт)
file-bytes-text=Размер файла (байт)
file-bytes-tips=Размер файла (байт)
file-pgcnt-text=Количество страниц во всем файле (измеренное)
file-pgcnt-tips=Количество страниц во всем файле (измеренное)
file-pgcnt2-text=Количество страниц во всем файле (вычисленное)
file-pgcnt2-tips=Количество страниц во всем файле (вычисленное)
inuse-pgcnt-text=Количество страниц с данными (используемых)
inuse-pgcnt-tips=Количество страниц с данными (используемых)
free-pgcnt2-text=Количество страниц без данных (по заголовку)
free-pgcnt2-tips=Количество страниц без данных (по заголовку)
free-pgcnt-text=Количество страниц без данных (вычисленное)
free-pgcnt-tips=Количество страниц без данных (вычисленное)
av-pgcnt-text=Количество автоматически очищенных страниц
av-pgcnt-tips=Количество автоматически очищенных страниц
ntable-text=Количество таблиц в БД
ntable-tips=Количество таблиц в БД
nindex-text=Количество индексов
nindex-tips=Количество индексов
nmanindex-text=Количество определенных индексов
nmanindex-tips=Количество определенных индексов
nautoindex-text=Количество неявных индексов (автоинкремент)
nautoindex-tips=Количество неявных индексов (автоинкремент)
user-payload-text=Байт, занятых полезной нагрузкой пользователя
user-payload-tips=Байт, занятых полезной нагрузкой пользователя
all-tbl-entrycnt-title=Общее количество записей во всех таблицах
all-tbl-idx-pagecnt-title=Количество страниц всех таблиц и их индексов
sperate-tbl-idx-pagecnt-title=Количество страниц всех таблиц и индексов (отдельно)
all-tbl-idx-report-title=Все таблицы и индексы
total-pages-percent-text=Процент от общего числа страниц БД
total-pages-percent-tips=Процент от общего числа страниц БД
nentry-text=Количество записей
nentry-tips=Количество записей
storage-text=Используемый объем памяти (байт)
storage-tips=Используемый объем памяти (байт)
compressed-size-text=Используемый объем после сжатия (байт)
compressed-size-tips=Используемый объем после сжатия (байт)
payload-text=Объем полезной нагрузки (байт)
payload-tips=Объем полезной нагрузки (байт)
total-meta-text=Объем метаданных (байт)
total-meta-tips=Объем метаданных (байт)
depth-text=Глубина B-дерева
depth-tips=Глубина B-дерева
avg-payload-text=Средняя полезная нагрузка на запись
avg-payload-tips=Средняя полезная нагрузка на запись
avg-unused-text=Среднее количество неиспользуемых байт на запись
avg-unused-tips=Среднее количество неиспользуемых байт на запись
avg-meta-text=Средний объем метаданных на запись
avg-meta-tips=Средний объем метаданных на запись
avg-fanout-text=Средний коэффициент разветвления
avg-fanout-tips=Средний коэффициент разветвления
gap-cnt-text=Несмежные страницы
gap-cnt-tips=Несмежные страницы
mx-payload-text=Максимальная полезная нагрузка на запись
mx-payload-tips=Максимальная полезная нагрузка на запись
ovfl-cnt-text=Количество использованных переполненных записей
ovfl-cnt-tips=Количество использованных переполненных записей
int-pages-text=Количество использованных страниц индексов
int-pages-tips=Количество использованных страниц индексов
leaf-pages-text=Количество использованных листовых страниц
leaf-pages-tips=Количество использованных листовых страниц
ovfl-pages-text=Количество использованных страниц переполнения
ovfl-pages-tips=Количество использованных страниц переполнения
total-pages-text=Общее количество использованных страниц
total-pages-tips=Общее количество использованных страниц
int-unused-text=Неиспользуемые байты на страницах индексов
int-unused-tips=Неиспользуемые байты на страницах индексов
leaf-unused-text=Неиспользуемые байты на листовых страницах
leaf-unused-tips=Неиспользуемые байты на листовых страницах
ovfl-unused-text=Неиспользуемые байты на страницах переполнения
ovfl-unused-tips=Неиспользуемые байты на страницах переполнения
total-unused-text=Неиспользуемые байты на всех страницах
total-unused-tips=Неиспользуемые байты на всех страницах
all-table-report-title=Все таблицы (без индексов)
all-indices-report-title=Все индексы (без таблиц)
tbl-and-all-idx-report-title=Таблица {tblName} и все ее индексы
tbl-only-report-title=Таблица {tblName} (без индексов)
idx-only-report-title=Все индексы таблицы {tblName}
tbl-report-title=Таблица {tblName}
idx-report-title=Индекс {idxName} таблицы {tblName}
props-tbl-only-report-title=Анализ хранилища таблицы {tblName}
props-idx-props-only-report-title=Все индексы таблицы {tblName}
db-pragma-params=Параметры PRAGMA
db-quick-config-params=Быстрые настройки
select-pragma=PRAGMA
pragma-analysis-limit-tips=Запрос или изменение ограничений для настроек анализа (ANALYZE). Это приблизительное количество строк, которое команда ANALYZE проверяет в каждом индексе.
pragma-application-id-tips=Используется для запроса или установки 32-битного знакового целого числа "Application ID" с порядком байт big-endian, расположенного по смещению 68 в заголовке базы данных.
pragma-auto-vacuum-tips=Запрос или установка статуса автоматической очистки (auto-vacuum) в базе данных.
pragma-automatic-index-tips=Запрос, установка или отключение функции автоматического индексирования.
pragma-busy-timeout-tips=Запрос или изменение настройки тайм-аута ожидания (busy timeout).
pragma-cache-size-tips=Запрос или изменение максимального количества страниц диска базы данных, которое SQLite рекомендует хранить в памяти для каждого открытого файла базы данных.
pragma-cache-spill-tips=Включение или отключение возможности программы подкачки сбрасывать "грязные" страницы кэша в файл базы данных во время транзакции.
pragma-case-sensitive-like-tips=Поведение оператора LIKE по умолчанию игнорирует регистр символов ASCII. Таким образом, по умолчанию 'a' LIKE 'A' истинно.
pragma-cell-size-check-tips=Включение или отключение дополнительных проверок целостности при чтении страниц B-дерева базы данных с диска. При включенной проверке размера ячейки повреждение базы данных может быть обнаружено раньше и с меньшей вероятностью "распространится".
pragma-checkpoint-fullfsync-tips=Запрос или изменение флага fullfsync для операций контрольной точки (checkpoint). Если этот флаг установлен, метод синхронизации F_FULLFSYNC будет использоваться во время операций контрольной точки в системах, поддерживающих F_FULLFSYNC. Значение флага CHECKPOINT_FULLFSYNC по умолчанию - OFF. Только Mac OS-X поддерживает F_FULLFSYNC.
pragma-collation-list-tips=Возвращает список последовательностей сортировки (collation), определенных для текущего подключения к базе данных.
pragma-compile-options-tips=Возвращает имена параметров компиляции, использованных при сборке SQLite, по одному параметру на строку.
pragma-count-changes-tips=Запрос или изменение флага подсчета изменений (count changes). Обычно, когда флаг count-changes не установлен, операторы INSERT, UPDATE и DELETE не возвращают данные.
pragma-data-store-directory-tips=Запрос или изменение значения глобальной переменной sqlite3_data_directory, используемой внутренним интерфейсом Windows для определения местоположения файлов базы данных, указанных с относительным путем.
pragma-data-version-tips=Указывает, что файл базы данных был изменен. Интерактивные программы, хранящие содержимое базы данных в памяти или отображающие его на экране, могут использовать команду PRAGMA data_version для определения необходимости обновления кэша или экрана.
pragma-default-cache-size-tips=Запрос или установка рекомендуемого максимального количества страниц дискового кэша, выделяемого для каждого открытого файла базы данных.
pragma-defer-foreign-keys-tips=Указывает отложить проверку всех ограничений внешнего ключа до момента фиксации самой внешней транзакции.
pragma-empty-result-callbacks-tips=Запрос или изменение флага обратного вызова для пустого результата.
pragma-encoding-tips=Текстовая кодировка, используемая основной базой данных: 'UTF-8', 'UTF-16le' (little-endian UTF-16) или 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Проверяет базу данных или таблицу на наличие нарушений ограничений внешнего ключа.
pragma-foreign-keys-tips=Запрос, установка или отключение принудительного соблюдения ограничений внешнего ключа.
pragma-freelist-count-tips=Возвращает количество неиспользуемых страниц в файле базы данных.
pragma-full-column-names-tips=Запрос или изменение флага full_column_names.
pragma-fullfsync-tips=Запрос или изменение флага fullfsync. Этот флаг определяет, будет ли использоваться метод синхронизации F_FULLFSYNC в системах, которые его поддерживают. Значение fullfsync по умолчанию - OFF. Только Mac OS X поддерживает F_FULLFSYNC.
pragma-hard-heap-limit-tips=Устанавливает ограничение на объем памяти кучи (heap) для всех подключений к базе данных в одном процессе.
pragma-ignore-check-constraints-tips=Включает или отключает принудительное соблюдение ограничений CHECK. Значение по умолчанию - OFF, что означает, что ограничения CHECK применяются по умолчанию.
pragma-incremental-vacuum-tips=Вызывает удаление до N страниц из списка свободных страниц (freelist).
pragma-integrity-check-tips=Выполняет низкоуровневую проверку форматирования и целостности базы данных.
pragma-journal-mode-tips=Запрос или установка режима журнала (journal mode) для базы данных, связанной с текущим подключением.
pragma-journal-size-limit-tips=Ограничивает размер файлов журнала отката (rollback journal) и WAL, остающихся в файловой системе после транзакции или контрольной точки.
pragma-legacy-alter-table-tips=Устанавливает или запрашивает значение флага legacy_alter_table.
pragma-locking-mode-tips=Устанавливает или запрашивает режим блокировки (locking mode) подключения к базе данных. Режимы: NORMAL или EXCLUSIVE.
pragma-max-page-count-tips=Запрос или установка максимального количества страниц в файле базы данных.
pragma-mmap-size-tips=Запрос или изменение максимального количества байт, зарезервированных для ввода-вывода с отображением в память (memory-mapped I/O) для одной базы данных.
pragma-module-list-tips=Возвращает список модулей виртуальных таблиц, зарегистрированных в подключении к базе данных.
pragma-optimize-tips=Пытается оптимизировать базу данных.
pragma-page-count-tips=Возвращает общее количество страниц в файле базы данных.
pragma-page-size-tips=Запрос или установка размера страницы базы данных. Размер страницы должен быть степенью двойки от 512 до 65536.
pragma-parser-trace-tips=Включает трассировку синтаксического анализатора SQL, используемого внутри SQLite. Работает только при компиляции с SQLITE_DEBUG.
pragma-query-only-tips=Запрещает изменение данных в файле базы данных. Если эта опция включена, любая попытка CREATE, UPDATE, DROP, INSERT или UPDATE приведет к ошибке SQLITE_READONLY.
pragma-quick-check-tips=Выполняет низкоуровневую проверку форматирования и целостности базы данных, пропуская проверки целостности UNIQUE и индексов.
pragma-read-uncommitted-tips=Запрос, установка или отключение уровня изоляции READ UNCOMMITTED.
pragma-recursive-triggers-tips=Запрос, установка или отключение рекурсивного выполнения триггеров.
pragma-reverse-unordered-selects-tips=Если эта прагма включена, многие SELECT запросы без ORDER BY будут возвращать результаты в обратном обычному порядке.
pragma-schema-version-tips=Получает или устанавливает целочисленное значение schema_version по смещению 40 в заголовке базы данных.
pragma-secure-delete-tips=Запрос или изменение настройки безопасного удаления (secure-delete).
pragma-short-column-names-tips=Запрос или изменение флага коротких имен столбцов.
pragma-soft-heap-limit-tips=Ограничивает объем памяти кучи, используемой всеми подключениями к базе данных в одном процессе.
pragma-stats-tips=Возвращает вспомогательную информацию о таблицах и индексах.
pragma-synchronous-tips=Запрос или изменение настройки флага "synchronous".
pragma-temp-store-tips=Запрос или изменение значения глобальной переменной sqlite3_temp_directory, используемой многими внутренними интерфейсами ОС для определения места хранения временных таблиц и индексов.
pragma-threads-tips=Количество вспомогательных потоков, запускаемых подготовленным запросом (prepared statement) для помощи в выполнении.
pragma-trusted-schema-tips=Разрешено ли выполнение небезопасных SQL-функций и виртуальных таблиц в схеме. Определяет, могут ли представления, триггеры или выражения схемы (например, ограничения CHECK, предложения DEFAULT, генерируемые столбцы, индексы на выражениях и/или частичные индексы) выполнять не прошедшие проверку безопасности SQL-функции и виртуальные таблицы.
pragma-user-version-tips=Получает или устанавливает целочисленное значение user_version по смещению 60 в заголовке базы данных.
pragma-vdbe-addoptrace-tips=Полные коды операций VDBE отображаются в процессе генерации кода. Работает, если SQLite скомпилирован с опцией SQLITE_DEBUG и включен vdbe_debug.
pragma-vdbe-debug-tips=Включает отладку VDBE. Работает, если SQLite скомпилирован с опцией SQLITE_DEBUG.
pragma-vdbe-listing-tips=Выводит полный список кодов операций виртуальной машины на стандартный вывод. Работает, если SQLite скомпилирован с опцией SQLITE_DEBUG и включен vdbe_debug.
pragma-vdbe-trace-tips=Выводит коды операций виртуальной машины на стандартный вывод во время вычислений. Работает, если SQLite скомпилирован с опцией SQLITE_DEBUG и включен vdbe_debug.
pragma-wal-autocheckpoint-tips=Запрос или установка интервала автоматической контрольной точки (auto-checkpoint) для упреждающего журнала (write-ahead log).
pragma-wal-checkpoint-tips=Вызывает перенос содержимого упреждающего журнала (write-ahead log) для базы данных X в подключении D в файл базы данных и сброс упреждающего журнала.
pragma-writable-schema-tips=Разрешает изменение таблицы sqlite_schema с помощью обычных операторов UPDATE, INSERT и DELETE. Предупреждение: неправильное использование этой прагмы может легко привести к повреждению файла базы данных.
pragma-save-confirm=Оператор PRAGMA повлияет на работу базы данных. Подтвердить выполнение следующего оператора?
confirm-exec-text=Подтвердить и выполнить